src/cf/InformationRegisters/СтатусыЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>СтатусыЗаказов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказовКлиентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/СвязиОбъектовИСообщенийRMQ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>СвязиОбъектовИСообщенийRMQ</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НаправленияСообщенийRMQ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Обменник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Блюда</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВходящееСообщение</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсходящееСообщение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/СтатусыЗаказовКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>СтатусыЗаказовКлиентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученНаКухне</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Готовится</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Готов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подан</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonModules/РаботаССообщениямиRMQ/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ОбработатьВходящееСообщение(ВходящееСообщение) Экспорт
	
	Перем Объект;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТелоJSON = КоннекторHTTP.JsonВОбъект(ВходящееСообщение.Тело,, Новый Структура("ПрочитатьВСоответствие", Ложь));
	
	Если ВходящееСообщение.Обменник = "statuses" Тогда
		ЗаказКлиента = Документы.ЗаказКлиента.НайтиПоИдентификатору(ТелоJSON.Ссылка);
		Объект = ЗаказКлиента;
		РегистрыСведений.СтатусыЗаказов.ОбновитьСтатусЗаказа(ЗаказКлиента, Перечисления.СтатусыЗаказовКлиентов[ТелоJSON.Статус]);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект) Тогда
		РегистрыСведений.СвязиОбъектовИСообщенийRMQ.СоздатьНовуюСвязь(Объект, ВходящееСообщение);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтправитьИсходящееСообщениеПоЗаказу(Заказ, ИсходящееСообщение) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	РезультатОтправки = КоннекторRMQ.ОтправитьСообщениеВОчередь(ИсходящееСообщение);
	
	Если РезультатОтправки.Отправлено И РегистрыСведений.СтатусыЗаказов.АктуальныйСтатусЗаказа(Заказ) = Перечисления.СтатусыЗаказовКлиентов.Создан Тогда
		РегистрыСведений.СтатусыЗаказов.ОбновитьСтатусЗаказа(Заказ, Перечисления.СтатусыЗаказовКлиентов.Отправлен);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
